Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh99-v2.tmx
Source language: bo
Languages: en

source: འདི་ལྟ་སྟེ་དམིགས་པ་ཐམས་ཅད་ལ་རྟོག་པ་ཞེས་བྱ་བ་སངས་རྒྱས་བྱེ་བ་ཁྲག་ཁྲིག་དཔག་ཏུ་མེད་པ་རྣམས་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་དེ་རེ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་སེམས་མི་འཇུག་གོ། །
en: He had formed roots of virtue with countless quadrillions of buddhas, though for some time his mind had not penetrated unsurpassed and perfect awakening.

source: བླ་ན་མེད་པའི་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་ཤིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་སྦྱོང་བར་འདོད་པ་ཞིག་བྱུང་སྟེ
en: He abided genuinely by the unexcelled Great Vehicle and aimed to purify a truly inexpressible amount of buddha realms.

source: དེའི་ཚེ་དགེ་སློང་གཅིག་པོ་དེ་ལྷ་ཚེ་རིངས་པོ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་པ་མ་གཏོགས་པར། སེམས་ཅན་གང་དག་གིས་ཀྱང་བྱང་ཆུབ་ཀྱི་ས་བོན་མ་བསྐྱེད་པར་མ་གྱུར་ཏོ། །
en: Aside from that single monk, born among the long-living gods, there were no sentient beings who had failed to produce the seeds of awakening.

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་གྲགས་པ་བསྒྲགས་པ་དེ་སངས་རྒྱས་ཀྱི་མཛད་པ་མཛད་པ་ན་ངས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་སེམས་ཅན་གཅིག་པོ་དེ་མ་གཏོགས་པར་སེམས་ཅན་གྱི་དོན་མ་བྱས་པ་གང་ཡིན་ཞེས་རྣམ་པར་གཟིགས་སོ། །
en: As the thus-gone Proclaimer of Fame was carrying out his awakened activity, he wondered, ‘Other than that single being, is there anyone else in my entire buddha realm whom I cannot benefit?’

source: དེའི་དགེ་བའི་རྩ་བ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སྣོད་དུ་གྱུར་པར་གཟིགས་ཀྱང་དེ་མི་ཁོམ་པ་ཐོབ་བོ། །དེས་ན་བདག་ཉིད་བླ་ན་
en: He saw that the monk’s roots of virtue enabled him to be a worthy vessel for unsurpassed and perfect awakening, and yet he had ended up unfree.

source: མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་སྐལ་བ་མེད་དོ། །
en: Thus he lacked the fortune to produce the roots of virtue for unsurpassed and perfect awakening.

source: དེ་ནས་ཤི་ནས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་མནར་མེད་པར་ལྷུང་ངོ་། །
en: After the monk died, he descended to the Hell of Incessant Pain,

source: དེ་དེར་བསྐལ་པར་འདུག་གོ །
en: where he remained for eons.

source: དེར་ཡང་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་དགེ་བའི་རྩ་བ་བསྐྱེད་པའི་སྐལ་བ་མེད་དོ། །
en: There as well he did not have the fortune to form the roots of virtue needed for unsurpassed and perfect awakening.

source: དེ་ནས་ཤི་ནས་མིར་སྐྱེས་ཏེ། གླེན་ཞིང་ལོང་ལ་ལྐུགས་ཤིང་ལག་བརྡ་བྱེད་པ་ཆོས་ཀུན་ཏུ་ཤེས་པའི་སྟོབས་མེད་དོ། །
en: When he eventually died there, he was born as a human, though as a gesticulating, blind, and mute fool incapable of comprehending the Dharma.

source: དེར་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་དག་གིས་དེ་ཡོངས་སུ་སྨིན་པར་མཛད་དེ།
en: Then emanations of the Thus-Gone One finally brought him to maturity.

source: དེའི་སྤྲུལ་པས་ཡོངས་སུ་སྨིན་པར་མཛད་པ་ན་དེ་བཞིན་གཤེགས་པ་དེ་སྐུ་ཚེ་བྱེ་བ་ཁྲག་ཁྲིག་ཕྲག་དྲུག་ཅུར་ཐུགས་སྐྱོ་བར་བྱས་སོ། །
en: When the Thus-Gone One’s emanations finally brought him to maturity, the Thus-Gone One had been feeling sorrow for sixty quadrillion lifetimes.

source: མཽད་གལ་གྱི་བུ་ཇི་ཙམ་དུ་དེ་བཞིན་གཤེགས་པའི་ཐུགས་རྗེ་ཆེན་པོ་སེམས་ཅན་གཅིག་ལ་མཛད་པ་ཐུགས་སྐྱོ་བར་གྱུར་པ་ལ་ལྟོས།
en: “Maudgalyāyana, consider the extent of the Thus-Gone One’s great compassion in feeling sorrow while acting for a single being.

source: དེ་བཞིན་གཤེགས་པས་གང་ཟག་དེ་ཡོངས་སུ་སྨིན་ཅིང་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་རབ་ཏུ་གཞག་པར་མ་སྤྱད་དོ། །
en: The Thus-Gone One could not bring that being to maturity and bring him to non-regression.

source: མཽད་གལ་གྱི་བུ་གང་ཟག་གང་གིས་བསོད་ནམས་མ་ཡིན་པ་མངོན་པར་འདུས་བྱས་པ་དེས་ཡུན་དེ་ཙམ་དུ་དེ་བཞིན་གཤེགས་པ་དེ་ཐུགས་སྐྱོ་བར་བྱས་པ་ལ་ལྟོས།
en: Maudgalyāyana, consider how the Thus-Gone One remained sorrowful for as long as any being was acting unvirtuously.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཐུགས་མངོན་པར་དགྱེས་པར་བྱ་བར་འདོད་པས་བདག་སྣོད་དུ་འགྱུར་བར་བྱ།
en: Therefore, Maudgalyāyana, bodhisattvas who wish to please the thus-gone ones should make themselves worthy vessels.

source: དེ་བཞིན་གཤེགས་པ་ཐུགས་སྐྱོ་བར་འགྱུར་བར་མི་བྱ་སྟེ། བདག་ཉིད་སྣོད་དུ་འགྱུར་བར་བྱ།
en: They should not sadden the Thus-Gone One, but make themselves worthy vessels.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་བདག་ཉིད་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་རབ་ཏུ་གནས་པས་དེ་བཞིན་གཤེགས་པས་རྗེས་སུ་བསྲུངས་ན་བདག་སྣོད་དུ་འགྱུར་བར་བྱའོ། །
en: Those noble sons and daughters who abide by the Great Vehicle should make themselves worthy vessels under the safeguarding of the Thus-Gone One.

source: མཽད་གལ་གྱི་བུ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་གཅིག་པོ་ཆོས་ཀྱི་སྣོད་མ་ཡིན་པར་གྱུར་པ་ལྷ་ཚེ་རིངས་པོ་རྣམས་ཀྱི་ནང་དུ་སྐྱེས་པར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: “What do you think, Maudgalyāyana? In case you may think that at that time that single bodhisattva who was not a vessel for the Dharma and who had taken rebirth among the long-living gods was anyone else, do not think so.

source: དེ་བཞིན་གཤེགས་པ་བདུད་རྩིའི་འོད་དེ་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའི་སྣོད་མ་ཡིན་པར་གྱུར་ཏེ།
en: In those days the unworthy bodhisattva was the thus-gone Amṛtaprabha.

source: ཆོས་ལ་བརྙས་པ་བྱས་པས་ལོག་པར་ལྷུང་ངོ་། །
en: He had disparaged the Dharma and thus fell astray.

source: དེའི་ཚེ་དེའི་དུས་ན་གང་གིས་སེམས་ཅན་དེ་ཡོངས་སུ་སྨིན་པར་མཛད་པའི་དེ་བཞིན་གཤེགས་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the thus-gone one who brought that being to maturity was anyone else, do not think so.

source: དེ་ནི་དེ་བཞིན་གཤེགས་པ་དོན་ཐམས་ཅད་གྲུབ་པ་ཡིན་ནོ། །
en: It was the thus-gone Sarvārthasiddhi.

source: དེའི་ཚེ་སེམས་ཅན་དེ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དོན་དུ་བསྐལ་པ་གྲངས་མེད་པར་བཞུགས་ཀྱིས་ཀྱང་སེམས་ཅན་དེ་ཡོངས་སུ་སྨིན་པར་མཛད་པར་མ་སྤྱོད་དོ། །
en: In order to bring that being to maturity he remained for innumerable eons and even then could not mature him.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་ལ་ཡང་དག་པར་གནས་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོས་དེ་བཞིན་གཤེགས་པ་མངོན་པར་དགྱེས་པར་བྱ་བའི་དོན་དུ་བདག་སྣོད་དུ་འགྱུར་བར་བྱ་སྟེ
en: Therefore, Maudgalyāyana, those noble sons or daughters who genuinely abide by the vehicle of the bodhisattvas should make themselves suitable vessels in order to please the thus-gone ones;

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཐུགས་སྐྱོ་བར་འགྱུར་བར་མི་བྱའོ། །
en: they should not sadden the thus-gone ones.

source: མཽད་གལ་གྱི་བུ་ངས་ཏིང་ངེ་འཛིན་ཤེས་པ་འགོག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བཤད་པར་བྱ་སྙམ་ནསདགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་རྒྱ་ཆེ་བ་དཔག་ཏུ་མེད་པ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Furthermore, Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created a boundless amount of numerous and vast roots of virtue in order to understand cessation as related to knowledge of absorption. I did this, long before even the distant past, by wondering how I could fully awaken to unsurpassed and perfect buddhahood and then teach sentient beings.

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན་རྒྱལ་པོ་བློ་གྲོས་དག་པ་ཞེས་བྱ་བ་ཞིག་བྱུང་སྟེ།
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a king named Pure Intellect.

source: དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་དང་ལྡན་པ།
en: He possessed limitless roots of virtue.

source: དེ་བཞིན་གཤེགས་པ་དཔག་ཏུ་མེད་པ་རྣམས་ཀྱི་ཚངས་པར་སྤྱོད་པ་ཤིན་ཏུ་སྤྱད་པ། དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་རིམ་གྲོ་པ་ལན་མང་དུ་བྱས་པར་གྱུར་ཏོ། །
en: He had practiced the pure conduct of countless thus-gone ones while serving as their attendants on numerous occasions.

source: དེ་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་རིམ་གྲོ་པ་བྱས་ནས་འདི་ལྟར་སེམས་བསྐྱེད་དེ།
en: Having attended to those thus-gone ones with the awakening mind of all the thus-gone ones, he eventually had the thought, ‘I should not try to please the Thus-Gone One with conceptual service.

source: བདག་མཚན་མའི་རིམ་གྲོས་དེ་བཞིན་གཤེགས་པའི་ཐུགས་མཉེས་པར་མི་བྱ། བདག་ནམས་ཀྱང་འཇིག་རྟེན་པའི་ཟང་ཟིང་གི་སེམས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་རིམ་གྲོ་མི་བྱ།
en: I should not serve the Thus-Gone One with a mundane materialistic attitude. Instead, since what I desire is omniscience, I should try to serve the thus-gone ones without any sense of pleasing them or displeasing them.

source: གཞན་དུ་ན་བདག་ཐམས་ཅད་མཁྱེན་པ་འདི་ཉིད་འདོད་པའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་ཡིད་དུ་འཐད་དེ་ཡིད་དུ་མི་འཐད་པ་མ་ཡིན་པས་རིམ་གྲོ་བྱའོ། །
en: By serving the thus-gone ones in this way, may I achieve omniscient wisdom.

source: དེ་བཞིན་གཤེགས་པ་ལ་རིམ་གྲོ་བྱས་པ་འདིས་བདག་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་པར་གྱུར་ཅིག །དེ་ལྟར་ངས་སེམས་བསྐྱེད་ནས་ཇི་ལྟར་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སེམས་ཅན་ཐམས་ཅད་མངོན་པར་ཤེས་པ་མྱུར་བ་སླ་བའི་ལམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྙམ་ནས
en: Forming such a resolve, just as I fully awaken to unsurpassed and perfect buddhahood, I will also fully awaken all sentient beings to unsurpassed and perfect buddhahood through the easy path of the swift superknowledges.

source: དེས་བདག་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སེམས་ཅན་དེ་དག་ཐམས་ཅད་མངོན་པར་ཤེས་པ་མྱུར་བ་སླ་བའི་ལམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་རྗེས་སུ་ཐོབ་པར་བྱས་སོ། །
en: Thus, as I carry out the training of a bodhisattva, all those beings will subsequently achieve unsurpassed and perfect awakening through the easy path of the swift superknowledges.

source: ཇི་ལྟར་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཞིང་དེར་སངས་རྒྱས་ཤིན་ཏུ་མང་ཞིང་སངས་རྒྱས་ཀྱི་དཀོན་པར་མ་གྱུར་ཅིག་ཅེས་དེ་ལྟ་བུའི་སེམས་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་རིམ་གྲོ་བྱས་སོ། །
en: In that field where I fully awaken to unsurpassed and perfect awakening, may buddhas be plentiful; may there never be a scarcity of buddhas!’ With that in mind, I served all the thus-gone ones.

source: དགེ་བའི་རྩ་བ་དེས་ངའི་བསྐལ་པ་བཟང་པོ་འདི་ལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དགུ་བརྒྱ་དགུ་བཅུ་རྩ་དྲུག་བྱུང་ངོ་། །
en: “Due to those roots of virtue, here in my excellent eon, nine hundred and ninety-six thus-gone ones, worthy ones, perfect buddhas have appeared.

source: དེ་བཞིན་གཤེགས་པ་གང་དག་ལ་བདག་གིས་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དགེ་བའི་རྩ་བ་བསྐྱེད་དུ་བཙུད་པའི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལ་བདག་གིས་མཆོད་དོ། །
en: I worshiped all these thus-gone ones who led bodhisattvas to create roots of virtue.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ནི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ལ་བདག་གི་ལུས་ཀྱི་ལས་ཡོངས་སུ་དག་པས་རིམ་གྲོ་བྱས། ངག་གི་ལས་ཡོངས་སུ་དག་པས་བསྟོད། ཡིད་ཀྱི་ལས་ཡོངས་སུ་དག་པས་ངེས་པར་བསམས་སོ། །
en: Forming roots of virtue with all those thus-gone ones, I served all of them with immaculate physical actions, praised them with immaculate speech, and reached certainty with immaculate mental conduct.

source: དགེ་བའི་རྩ་བ་དེས་དེའི་སྐུ་རྒྱ་ཆེན་པོར་གྱུར་ཏོ། །
en: Due to these roots of virtue, my forms have proliferated.

source: ངས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་རིམ་གྲོ་ཡོངས་སུ་སྤྱད་པས་རྙེད་པ་མཆོག་དང་གྲགས་པ་མཆོག་ཐོབ་བོ། །ངས་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་གསུང་རབ་ལ་བསམ་པ་དྲག་པས་རབ་ཏུ་གནས་སོ། །
en: Acting in the service of all those thus-gone ones, I achieved the supreme attainment and utmost renown. I immersed myself in intense contemplation of all the thus-gone ones’ teachings.

source: དགེ་བའི་རྩ་བ་དེས་ངའི་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་ཆེ་སྟེ་མཐའ་གཞལ་བར་མི་ནུས་སོ། །
en: By these roots of virtue, my buddha realm is so vast that its limits cannot be measured.

source: མཽད་གལ་གྱི་བུ་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་རྙེད་པ་མཆོག་དང་གྲགས་པ་མཆོག་ཐོབ་པ་དང་གསུང་རབ་འདོད་པས་དེ་བཞིན་གཤེགས་པ་ལ་རིམ་གྲོ་ཡོངས་སུ་སྤྱད་ཅིང་སེམས་ཡོངས་སུ་དུལ་བར་བྱ།
en: “Therefore, Maudgalyāyana, bodhisattvas who seek the supreme attainment, utmost renown, and who also seek teachings, should attend upon the thus-gone ones and calm their minds.

source: བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་རྒྱ་ཆེ་བར་འདོད་པས་སྒྲིབ་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་སྔོན་དུ་བྱས་ཏེ་སྤྱོད་པ་སྤྱད་པར་བྱ།
en: Bodhisattvas who seek a vast buddha realm should begin by seeing stainless wisdom and then engage in training.

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྟོགས་པར་བྱ་བའི་ཕྱིར་དགེ་བའི་རྩ་བ་མངོན་པར་འདུ་བྱ་བ་རྣམས་ཀྱི་ཆོག་མི་ཤེས་པར་བྱའོ། །
en: They should be insatiable in forming roots of virtue in order to realize omniscient wisdom.

source: མཽད་གལ་གྱི་བུ་ངས་ཏིང་ངེ་འཛིན་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པར་བྱ་བའི་དོན་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོངས་སུ་ཚོལ་བ་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཏིང་ངེ་འཛིན་ཤེས་པ་འགོག་པར་འགྱུར་བའི་ལམ་ཤེས་པ་སེམས་ཅན་རྣམས་ལ་ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བྱ། བདག་ཆོས་སྟོན་པ་ཡང་ཟད་པ་མེད་པར་གྱུར་ཅིག་སྙམ་ནས་དགེ་བའི་རྩ་བ་རྣམ་པ་སྣ་ཚོགས་དུ་མ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: “Maudgalyāyana, I created numerous different roots of virtue in order to understand the path leading to cessation as related to knowledge of absorption. I did this by reflecting, ‘In the pursuit of unsurpassed and perfect awakening, how might I fully awaken to unsurpassed and perfect awakening, and then go on to genuinely teach beings the path that leads to cessation as related to knowledge of absorption? May I become inexhaustible in teaching the Dharma!’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། དེ་བཞིན་གཤེགས་པ་སྒྲ་ཐམས་ཅད་ཀྱི་དབྱངས་ཞེས་བྱ་བ་ནས་
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there appeared in the world a thus-gone one named Voice of All Sounds;

source: དེ་བཞིན་གཤེགས་པ་སྒྲ་ཐམས་ཅད་ཀྱི་དབྱངས་དེའི་ཉན་ཐོས་འདུས་པ་དང་བྱང་ཆུབ་སེམས་དཔའ་འདུས་པ་དཔག་ཏུ་མེད་པ་དག་བྱུང་སྟེ་
en: The thus-gone Voice of All Sounds had a following of hearers and a following of bodhisattvas that was beyond measure.

source: ཆོས་བཤད་པ་རེ་རེས་ཀྱང་ཉན་ཐོས་ཁྲག་ཁྲིག་དཔག་ཏུ་མེད་པ་དག་ངེས་པར་བྱུང་ངོ་། །བྱང་ཆུབ་སེམས་དཔའ་ཁྲག་ཁྲིག་དཔག་ཏུ་མེད་པ་དག་ཕྱིར་མི་ལྡོག་པ་ཉིད་ལ་གནས་སོ། །
en: With each Dharma teaching, countless hundreds of millions of hearers achieved emancipation, while countless hundreds of millions of bodhisattvas were established in non-regression.

source: དེའི་ཚེ་དེ་བཞིན་གཤེགས་པ་དེའི་བྱང་ཆུབ་སེམས་དཔའ་བདུད་རྩིའི་དབྱངས་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དེ་དག་ཐམས་ཅད་ལས་ཡོན་ཏན་དང་། ཡེ་ཤེས་ཁྱད་པར་དུ་འཕགས་པ་ཞིག་བྱུང་ངོ་། །
en: At the same time the Thus-Gone One had a bodhisattva named Ambrosial Voice, who surpassed the entire assembly of bodhisattvas in terms of his qualities and wisdom.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བདུད་རྩིའི་དབྱངས་དེ་འདི་སྙམ་དུ་སེམས་ཏེ།
en: Once, the bodhisattva Ambrosial Voice thought to himself,

source: དེ་བཞིན་གཤེགས་པ་སྒྲ་ཐམས་ཅད་ཀྱི་དབྱངས་འདིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡང་དག་པར་བསྡུས་པ་དེ་བཞིན་དུ་བདག་གིས་ཀྱང་ཡང་དག་པར་རབ་ཏུ་བསྡུ་བར་བྱའོ་སྙམ་མོ། །
en: ‘Just as the thus-gone Voice of All Sounds embodies unsurpassed and perfect awakening, so will I embody it.’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་སྒྲ་ཐམས་ཅད་ཀྱི་དབྱངས་དེ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཆེན་པོ་དེའི་མདུན་ན་བཞུགས་པ་ལ་ཚིགས་སུ་བཅད་པའི་དབྱངས་ཀྱིས་ཞུ་བ་ཞུས་པ།
en: In the presence of the thus-gone Voice of All Sounds and the great assembly of bodhisattvas, he asked in the form of a song:

source: འདྲེན་པ་མི་ཡི་ཁྱུ་མཆོག་སྟོབས་བཅུ་ཡོན་ཏན་མངའ་བ་ལྷ་ཡུལ་ས་སྟེང་མེད། །
en: “ ‘O Guide, bull among men, you possess the ten powers— There is no one like you in heaven or on earth.

source: རྒྱལ་མཆོག་མཆོག་རབ་ལྷ་མི་ཕན་མཛད་པ་ལས་འགྲོ་བའི་དོན་དུ་བདག་ཞུ་བ། །
en: Supreme, glorious Victor, aid to gods and men, I ask you for the sake of beings:

source: སྤྱོད་པ་ཇི་ལྟར་སྤྱད་ན་བློ་གྲོས་ལེགས་མཛད་འགྲོ་སྟོན་ཁྱོད་དང་འདྲ་བར་འགྱུར། །
en: “ ‘What practice might I train in to become like you, A guide of beings with sublime intelligence?

source: འགྲོ་ལ་ཕན་མཛད་བདག་དང་འགྲོ་བའི་ཐེ་ཚོམ་དེ་དག་མྱུར་དུ་གསུངས་ཤིག་གསུངས། །
en: Helper of beings, please quickly explain this And address the doubts of myself and others.

source: འགྲོ་བ་རྡུལ་དང་དྲི་མ་རྙོག་པ་སྡུག་བསྔལ་བརྒྱ་ཡིས་ཡོངས་ལྡན་རིག་ནས་སུ། །མཁས་པ་སྙིང་རྗེ་བསྐྱེད་དེ་ཇི་ལྟར་སྤྱད་ན་འགྲོ་ཕན་སྐྱེ་དགུ་རྣམ་འགྲེལ་བགྱིད། །
en: “ ‘Please explain for beings how the wise Develop compassion and help others, Knowing that beings are tainted with stains and impurities, With their hundreds of sorrows.

source: ཇི་ལྟར་འགྲོ་བ་སྡུག་བསྔལ་བརྒྱས་ཉེན་བདེ་བརྒྱའི་ཕྱི་རོལ་ཡིད་བདེ་མི་འཚལ་རྣམས། །དེ་དག་བདག་སྲིད་མྱུར་ཟད་བདེ་མཆོག་མཚུངས་མེད་འགྲོ་ལ་བསྟན་གྱིས་སྟོབས་བཅུ་གསུངས། །
en: “ ‘Please explain the ten powers and teach to beings— Afflicted as they are by hundreds of sorrows, And separate from hundreds of joys, who do not know happiness— How to swiftly end their existence and have unequaled, supreme joy.

source: ཇི་ལྟར་ཁྱོད་ཀྱི་གསུང་ཆེན་ཐོས་ནས་རབ་ཏུ་དགའ་ཞིང་འགྲོ་བ་ཡོངས་སུ་བསྟན། །
en: “ ‘Please teach beings how upon hearing your great words They can be utterly delighted.

source: ཇི་ལྟར་འགྲོ་བ་ཁྱོད་ཀྱི་གསུང་རྟོགས་གསུང་ལ་མཁས་ན་སྡུག་བསྔལ་ཡོངས་སུ་སྤོང་། །
en: How can beings comprehend your words, And, with knowledge of your words, give up suffering,

source: སྡུག་བསྔལ་ཟད་ཐོབ་མུན་བཅོམ་རབ་རིབ་མེད་ཅིང་རྒྱལ་བའི་ཉི་ཟེར་རབ་ཏུ་ལྡན། །
en: “ ‘Achieve the end of suffering, dispel darkness, Become free of murkiness, and attain the victors’ sunrays?

source: སྟོབས་བཅུ་མངའ་བའི་གསུང་གིས་འགྲོ་བ་འཇིགས་མེད་འགྱུར་བ་དེ་དག་བདག་ལ་གསུངས། །
en: Please tell me how beings become fearless With your speech possessed of ten powers.

source: རྒྱལ་བའི་གསུང་ཐོབ་གསུང་གིས་གཡོ་ཚིག་བཅོམ་སྟེ་སུ་ཞིག་གསུང་གནས་དགའ་བདེར་འགྱུར། །
en: “ ‘Gaining the victors’ speech, who will speak and vanquish deceitful words? Whose speech will lead to joy and happiness?

source: བདེ་གཤེགས་ཁྱོད་ཀྱི་གསུང་འཆང་མཁས་པ་དྲི་མ་སྐྱོན་སྤངས་ཤིན་ཏུ་དྲི་མེད་ཡིད། །
en: Blissful One, you possess that speech. Wise, free of faults and stains, with your immaculate mind,

source: དེས་ཐོབ་སྲིད་པའི་འགྲོ་སྤངས་འགྲོ་བ་མཆོག་ལ་གནས་ཏེ་རྒྱལ་མཆོག་འགྱུར་བ་ཡི། །
en: “ ‘With such attainment, you have forsaken the states of existence And dwell in the supreme state, the supreme victor.

source: རྒྱལ་བ་ཐུབ་པ་རྣམ་འདྲེན་འགྲོ་ལ་ཕན་མཛད་སྙན་པའི་གསུང་གིས་དེ་དག་གསུངས། །
en: O Victor, Sage, Guide, helper of beings, Please answer me with your pleasant words.’

source: སྟོན་པ་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་ཕན་བཞེད་དེ་ཡི་བསམ་པ་ཐུགས་ཆུད་ལུང་བསྟན་པ། །
en: “The Teacher, the Thus-Gone One and helper of the world, Was aware of his thoughts, and so replied,

source: སྡུག་བསྔལ་འདི་དག་ཟད་པར་རྒྱལ་བས་གཟིགས་པའི་མྱ་ངན་འདས་པའི་ལམ་བསྒོམས་ན། །
en: ‘In training on the path of nirvāṇa seen by the Victor, Which brings an end to such sorrows,

source: གང་དག་འདས་པའི་འཇིག་རྟེན་ཕན་འདོད་གང་ཡང་མ་འོངས་འཇིག་རྟེན་ཕན་པར་འདོད། །གང་དག་ད་ལྟར་འགྲོ་ལ་ཕན་འདོད་དེ་ཡང་ལམ་མཆོག་འདི་ནི་ཡོངས་སུ་མཐོང་། །
en: “ ‘Those who wish to help the world of the past, Who wish to help the world of the future, And who wish to help the beings of the present Should perceive this foremost of paths.

source: རྒྱལ་བའི་སྲས་དག་བྱང་ཆུབ་ཡོངས་སུ་ཚོལ་ན་དེ་ནི་རབ་ཏུ་འབད་དེ་སྒོམས། །
en: “ ‘The children of the Victor pursuing awakening Should persevere and train in this.

source: བདུད་ཀྱི་སྟོབས་མཆོག་བཅས་པ་སྟོབས་བཅོམ་སངས་རྒྱས་སྟོབས་ལ་མངོན་པར་མྱུར་དུ་འདུག །
en: They will vanquish powers such as the forces of Māra And swiftly possess the powers of buddhahood.’

source: བུ་དེས་ཐོས་ནས་ཐོགས་པར་བདེ་བར་གཤེགས་པའི་བཟོད་ལ་རབ་ཏུ་གནས། །སངས་རྒྱས་སྒྲ་ཀུན་མཁྱེན་པ་རྐང་གཉིས་མཆོག་ལ་དེ་ནི་སྐྱབས་སོང་བློ་གནས་སོ། །
en: “When the son heard that, he readily Gained a grounding in the Blissful One’s endurance, And took refuge in his heart In the foremost of humans, the buddha Voice of All Sounds.

source: མཽད་གལ་གྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། །
en: “What do you think, Maudgalyāyana?

source: དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་བདུད་རྩིའི་དབྱངས་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཡིན་པར་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ
en: In case you may think that at that time the bodhisattva Ambrosial Voice was anyone else, do not think so.

source: ང་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་བདུད་རྩིའི་དབྱངས་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: In those days I was the bodhisattva Ambrosial Voice.

source: དེའི་ཚེ་ཡང་ངས་སེམས་ཅན་གྱི་ཁམས་སྡུག་བསྔལ་ལས་ཡོངས་སུ་ཐར་བར་བྱས་སོ། །
en: At that time I gained liberation from the sorrows of the realm of beings.

source: ད་ལྟར་ཡང་ང་སེམས་ཅན་རྣམས་ཀྱི་སྡུག་བསྔལ་ཟད་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ། །
en: Still now I am teaching the Dharma in order to bring an end to beings’ suffering.”

source: མཽད་གལ་གྱི་བུ་ངས་སྙོམས་པར་འཇུག་པ་ཤེས་པར་བྱ་བའི་དོན་དུ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་བདག་བླ་ན་ མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས།
en: “Furthermore, Maudgalyāyana, when I was training in the practices of a bodhisattva in the past, I created numerous different roots of virtue in order to understand equilibrium.

source: སེམས་ཅན་རྣམས་ལ་སྙོམས་པར་འཇུག་པ་ཤེས་པ། ཇི་ལྟར་ཡང་དག་པར་རབ་ཏུ་བཤད་པར་བྱ་སྙམ་ནས་དགེ་བའི་རྩ་བ་རྣམ་པ་དུ་མ་དག་མངོན་པར་འདུས་བྱས་སོ། །
en: I did this by wondering, ‘How can I fully awaken to unsurpassed and perfect buddhahood and then properly teach beings how to understand equilibrium?’

source: མཽད་གལ་གྱི་བུ་སྔོན་བྱུང་བ་འདས་པའི་དུས་འཁོར་བ་དཔག་ཏུ་མེད་པ་ནས་དེའི་ཕ་རོལ་གྱི་ཡང་ཆེས་ཕ་རོལ་ན། རྒྱལ་པོ་སྤྱོད་པ་ཤིན་ཏུ་བརྟན་པ་ཞེས་བྱ་བ་ཆོས་ཀྱི་རྒྱལ་པོ་ཆོས་དང་ལྡན་པ་ཞིག་བྱུང་བ་ནས་ཤིན་ཏུ་གནས་པའི་བར་དུ་རྒྱ་ཆེར་སྦྱར་རོ། །
en: “Long ago in the limitless cycle of existence, Maudgalyāyana, long before even the distant past there was a religious king named Utterly Stable Conduct, who reigned over numerous regions under the single umbrella of his command.

source: དེའི་ཚེ་འཛམ་བུའི་གླིང་འདིར་གྲོང་ཁྱེར་བྱེ་བ་ཕྲག་དྲུག་ཅུ་བྱུང་ངོ་། །འཛམ་བུ་གླིང་འདི་དཔག་ཚད་སྟོང་ཕྲག་དྲུག་ཅུར་གྱུར་ཏོ། །
en: In that era there were six hundred million cities in this world, which was sixty thousand leagues across.

source: གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་ཐག་ཉེ་བས་གྲོང་ཁྱེར་དང་གྲོང་རྡལ་གྱི་བྱ་གག་གྲོང་ཕན་ཚུན་དུ་འགྲོ་བར་གྱུར་ཏོ། །
en: The towns, cities, and villages being in close proximity, the domestic fowls of the cities and villages would roam freely in the other towns.

source: དེར་རྒྱལ་པོ་སྤྱོད་པ་ཤིན་ཏུ་བརྟན་པ་གནས་ཏེ།
en: There lived King Utterly Stable Conduct.

source: ཆོམ་རྐུན་དང་ཀླ་ཀློ་དང་ནི་བྲལ། ཆོས་དང་ལྡན་པའི་མི་རྣམས་ཀྱིས་ནི་གང་དགའ་སྟོན་གྱི་དུས་ནི་མང་།
en: There were no thieves, robbers, or barbarians, but plenty of people of good morals. There were many festivals.

source: སྐྱེ་བོ་རབ་ཏུ་དགའ་བ་དག་གིས་ནི་མངོན་པར་གང་། ཆོས་སྤྱོད་པའི་མི་ནི་ཀུན་ཏུ་བྱུང་།
en: The world was filled with merry people, and people who cultivated the Dharma were plentiful.

source: ཐམས་ཅད་ནས་ཐམས་ཅད་དུ་སྡིག་པའི་ཐ་སྙད་ཀྱང་མེད་ན་དེ་སྤྱོད་པ་ལྟ་ཅི་ཞིག་ག་ལ་ཡོད།
en: The word ‘evil’ was unknown anywhere, let alone actual evil behavior.

source: ཕྱི་རོལ་དུ་སྐྱེད་མོས་ཚལ་དང་། ཀུན་དགའ་ར་བ་དང་། མཚེའུ་དང་རྫིང་བུ་དག་གིས་མཛེས་ཏེ། ལྷ་རྣམས་ཀྱི་དགའ་བའི་ཚལ་བཞིན་ནོ། །
en: The environment was beautified by groves, parks, ponds, and pools, like a divine garden.

source: རྟག་པར་རྒྱུན་དུ་དུང་དང་རྫ་རྔ་དང་ཁར་རྔ་དང་པི་ཝང་རྒྱུད་གསུམ་པ་དང་ཕྱོགས་མང་པོར་ཐོས་པའི་པི་ཝང་དང་། པི་ཝང་རྒྱུད་གཅིག་པ་དང་། ན་ཀུ་ལ་དང་། ཤིན་ཏུ་དབྱངས་སྙན་དང་། ཅང་ཏེའུ་དང་། བྲོ་གར་གྱི་རྒྱུད་དང་། བན་དུ་ར་དང་། བུམ་རྔ་དང་། གདུ་བུ་དང་། རོལ་མོ་མན་དུ་གའི་སྒྲ་སྣ་ཚོགས་ཀྱི་གླུ་དབྱངས་རྣམས་ཀྱིས་མངོན་པར་དགའ་བ་མི་མ་ཡིན་པ་དང་།
en: It was jubilant with the continuous, uninterrupted songs of conches, clay and wooden drums, three-stringed lutes, lutes resounding everywhere, single-stringed lutes, flutes, nakulas , beautiful voices, hand-drums, dance-cords, banduras , kettle drums, bracelets, and various lesser instruments.

source: ལྷའི་གནས་ལྟར་ལྷའི་རྒྱན་གྱི་ཤིང་གིས་ཀུན་ཏུ་ཁེབས་པ་སྤོས་དང་། ཕྲེང་བ་དང་གོས་ཀྱི་ཤིང་གིས་ཤིན་ཏུ་ཁེབས་པ། འདོད་པའི་འབྲས་བུའི་ཤིང་དང་ལྡན་པ་འཕགས་པའི་སྐྱེ་བོ་གནས་ཤིང་འཕགས་པ་མ་ཡིན་པའི་སྐྱེ་བོ་མེད་དོ། །
en: Like an abode of spirits or gods, it was filled with ornamental divine trees and trees of incense, garlands, and silk, and there were trees with desirable fruits. Noble beings lived there; there were no other beings but noble beings.

source: དེའི་ཚེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་དེ་བཞིན་གཤེགས་པ་དྲི་མེད་ཏོག་ཅེས་བྱ་བ་ནས།
en: “At that time there appeared in this trichiliocosm a thus-gone one named Stainless Zenith;

source: དེ་བཞིན་གཤེགས་པ་དྲི་མེད་ཏོག་དེའི་སྐུ་ཚེའི་ཚད་དཔག་ཏུ་མེད་པར་གྱུར་ཏོ། །
en: The thus-gone Stainless Zenith would live for an unfathomably long time.
